tylertms/dspic33e-sim/tests/device/qei_test.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"
#include "test.h"

enum {
    QEI_ENABLE = 0x8000u,
    QEI_STOP_IDLE = 0x2000u,
    QEI_POSITION_MODE_SHIFT = 10u,
    QEI_INDEX_MATCH_SHIFT = 8u,
    QEI_DIVIDER_SHIFT = 4u,
    QEI_GATE_ENABLE = 0x0004u,
    QEI_DIRECTION_INVERT = 0x0008u,
    QEI_MODE_QUADRATURE = 0u,
    QEI_MODE_UP_DOWN = 1u,
    QEI_MODE_GATE = 2u,
    QEI_MODE_TIMER = 3u,
    QEI_CAPTURE_HOME = 0x8000u,
    QEI_FILTER_ENABLE = 0x4000u,
    QEI_OUTPUT_GREATER_EQUAL = 0x0200u,
    QEI_OUTPUT_LESS_EQUAL = 0x0400u,
    QEI_OUTPUT_OUTSIDE = 0x0600u,
    QEI_SWAP = 0x0100u,
    QEI_PHASE_A_POLARITY = 0x0010u,
    QEI_STATUS_INDEX_ENABLE = 0x0001u,
    QEI_STATUS_INDEX = 0x0002u,
    QEI_STATUS_HOME_ENABLE = 0x0004u,
    QEI_STATUS_HOME = 0x0008u,
    QEI_STATUS_VELOCITY_OVERFLOW_ENABLE = 0x0010u,
    QEI_STATUS_VELOCITY_OVERFLOW = 0x0020u,
    QEI_STATUS_INITIALIZED_ENABLE = 0x0040u,
    QEI_STATUS_INITIALIZED = 0x0080u,
    QEI_STATUS_POSITION_OVERFLOW_ENABLE = 0x0100u,
    QEI_STATUS_POSITION_OVERFLOW = 0x0200u,
    QEI_STATUS_LOW_COMPARE_ENABLE = 0x0400u,
    QEI_STATUS_LOW_COMPARE = 0x0800u,
    QEI_STATUS_HIGH_COMPARE_ENABLE = 0x1000u,
    QEI_STATUS_HIGH_COMPARE = 0x2000u,
    CAPTURE_BASE = 0x0140u,
    CAPTURE_FP_EVERY_EDGE = 0x1c01u,
    CAPTURE_FP_RISING = 0x1c03u,
    QEI_VECTOR = 0x0240u
};

static const uint16_t bases[DSPIC33_QEI_COUNT] = {0x01c0u, 0x05c0u};
static const uint16_t pmd_addresses[DSPIC33_QEI_COUNT] = {0x0760u, 0x0764u};
static const uint16_t pmd_masks[DSPIC33_QEI_COUNT] = {0x0400u, 0x0020u};
static const uint16_t interrupt_addresses[DSPIC33_QEI_COUNT] = {0x0806u, 0x0808u};
static const uint16_t interrupt_masks[DSPIC33_QEI_COUNT] = {0x0400u, 0x0800u};
static const uint16_t pps_input_registers[DSPIC33_QEI_COUNT][2] = {{0x06bcu, 0x06beu},
                                                                   {0x06c0u, 0x06c2u}};

static uint32_t read_counter(Dspic33* cpu, uint16_t low) {
    uint32_t value = dspic33_read_word(cpu, low);
    return value | ((uint32_t)dspic33_read_word(cpu, (uint16_t)(low + 2u)) << 16u);
}

static void write_counter(Dspic33* cpu, uint16_t low, uint16_t hold, uint32_t value) {
    dspic33_write_word(cpu, hold, (uint16_t)(value >> 16u));
    dspic33_write_word(cpu, low, (uint16_t)value);
}

static bool input(Dspic33* cpu, uint8_t channel, Dspic33QeiInput source, bool high) {
    return dspic33_qei_input(cpu, channel, source, high, 0u) &&
           dspic33_device_advance(cpu, 0u);
}

static void reset_qei(Dspic33* cpu) {
    uint8_t channel;
    uint8_t source;
    dspic33_reset(cpu, 0u);
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        for (source = 0u; source < 4u; source++) {
            dspic33_qei_input(cpu, channel, (Dspic33QeiInput)source, false, 0u);
        }
    }
    dspic33_device_advance(cpu, 0u);
    dspic33_reset(cpu, 0u);
}

static void clear_interrupt(Dspic33* cpu, uint8_t channel) {
    dspic33_write_word(cpu, interrupt_addresses[channel],
                       (uint16_t)(dspic33_read_word(cpu, interrupt_addresses[channel]) &
                                  ~interrupt_masks[channel]));
}

static void select_pps_input(Dspic33* cpu, uint8_t channel, uint8_t input,
                             uint8_t pin) {
    uint16_t address = pps_input_registers[channel][input / 2u];
    if ((input & 1u) == 0u) {
        dspic33_write_byte(cpu, address, pin);
    } else {
        dspic33_write_byte(cpu, (uint16_t)(address + 1u), pin);
    }
}

static bool interrupt_set(Dspic33* cpu, uint8_t channel) {
    return (dspic33_read_word(cpu, interrupt_addresses[channel]) &
            interrupt_masks[channel]) != 0u;
}

static void configure_interrupt(Dspic33* cpu, uint8_t channel) {
    uint8_t irq = channel == 0u ? 58u : 75u;
    uint16_t enable = (uint16_t)(0x0820u + (irq / 16u) * 2u);
    uint16_t priority = (uint16_t)(0x0840u + (irq / 4u) * 2u);
    uint16_t shift = (uint16_t)((irq % 4u) * 4u);
    dspic33_write_word(
        cpu, enable,
        (uint16_t)(dspic33_read_word(cpu, enable) | (uint16_t)(1u << (irq % 16u))));
    dspic33_write_word(
        cpu, priority,
        (uint16_t)((dspic33_read_word(cpu, priority) & ~(uint16_t)(7u << shift)) |
                   (uint16_t)(3u << shift)));
    cpu->program[(0x0014u + irq * 2u) / 2u] = QEI_VECTOR;
    cpu->w[15] = 0x1800u;
}

static void set_open_comparison_window(Dspic33* cpu, uint16_t base) {
    dspic33_write_word(cpu, (uint16_t)(base + 0x1eu), 0x7fffu);
    dspic33_write_word(cpu, (uint16_t)(base + 0x1cu), 0xffffu);
    dspic33_write_word(cpu, (uint16_t)(base + 0x22u), 0x8000u);
    dspic33_write_word(cpu, (uint16_t)(base + 0x20u), 0x0000u);
}

static void register_cases(TestState* state, Dspic33* cpu) {
    static const uint16_t offsets[18] = {0x00u, 0x02u, 0x04u, 0x06u, 0x08u, 0x0au,
                                         0x0cu, 0x0eu, 0x10u, 0x12u, 0x14u, 0x16u,
                                         0x18u, 0x1au, 0x1cu, 0x1eu, 0x20u, 0x22u};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint8_t index;
        reset_qei(cpu);
        for (index = 0u; index < 18u; index++) {
            expect(state,
                   dspic33_read_word(cpu, (uint16_t)(base + offsets[index])) == 0u,
                   "QEI register reset");
        }
        dspic33_write_word(cpu, base, UINT16_MAX);
        expect(state, dspic33_read_word(cpu, base) == 0xbf7fu,
               "QEI control access mask");
        dspic33_write_word(cpu, base, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), UINT16_MAX);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0xffffu,
               "QEI IO control keeps live inputs read only");
        dspic33_write_word(cpu, (uint16_t)(base + 4u), 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 4u), UINT16_MAX);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 4u)) == 0x1555u,
               "QEI status flags cannot be software set");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x5678u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x1234u);
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 0x12345678u,
               "QEI direct position words read coherently");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) == 0x1234u,
               "QEI position low read captures high hold");
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au),
                      0xa1b2c3d4u);
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 0xa1b2c3d4u,
               "QEI position hold write commits with low word");
        write_counter(cpu, (uint16_t)(base + 0x16u), (uint16_t)(base + 0x1au),
                      0x10203040u);
        expect(state,
               read_counter(cpu, (uint16_t)(base + 0x16u)) == 0x10203040u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x1au)) == 0x1020u,
               "QEI index hold transfers both directions");
        dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), 0x55aau);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 0x55aau,
               "QEI velocity read returns pre-clear value");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 0u,
               "QEI velocity read clears counter");
        dspic33_write_word(cpu, (uint16_t)(base + 0x1cu), 0x2468u);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x1cu)) == 0x2468u,
               "QEI GEC and IC alias storage is writable");
    }
}

