tylertms/dspic33e-sim/tests/device/qei_test.c
static void quadrature_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_MODE_QUADRATURE);
        expect(state, input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "schedule QEI quadrature phase A rise");
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, false) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_B, false),
               "complete QEI positive quadrature cycle");
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 4u,
               "QEI x4 quadrature positive count");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 4u,
               "QEI velocity follows quadrature count");
        expect(state,
               input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   cpu->stop_reason == DSPIC33_SILICON_RESULT_UNDEFINED,
               "B1 positive-direction Index counter remains silicon-undefined");
        cpu->stop_reason = DSPIC33_RUNNING;
        input(cpu, channel, DSPIC33_QEI_INDEX, false);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_B, false) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, false),
               "complete QEI negative quadrature cycle");
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI x4 quadrature negative count");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_SWAP);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        expect(state, input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "schedule swapped QEI input");
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == UINT32_MAX,
               "QEI input swap reverses first phase direction");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_PHASE_A_POLARITY);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 1u) == 0u,
               "QEI polarity controls live phase status");
    }
}

static void quadrature_transition_cases(TestState* state, Dspic33* cpu) {
    static const int8_t actions[16] = {0, 1, -1, 0,  -1, 0,  0, 1,
                                       1, 0, 0,  -1, 0,  -1, 1, 0};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint8_t previous;
        for (previous = 0u; previous < 4u; previous++) {
            uint8_t current;
            for (current = 0u; current < 4u; current++) {
                int8_t action = actions[(previous << 2u) | current];
                uint32_t expected = (uint32_t)(0x100 + action);
                reset_qei(cpu);
                set_open_comparison_window(cpu, base);
                dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_FILTER_ENABLE);
                input(cpu, channel, DSPIC33_QEI_PHASE_A, (previous & 1u) != 0u);
                input(cpu, channel, DSPIC33_QEI_PHASE_B, (previous & 2u) != 0u);
                dspic33_device_advance(cpu, 3u);
                write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au),
                              0x100u);
                dspic33_write_word(cpu, base, QEI_ENABLE);
                input(cpu, channel, DSPIC33_QEI_PHASE_A, (current & 1u) != 0u);
                input(cpu, channel, DSPIC33_QEI_PHASE_B, (current & 2u) != 0u);
                expect(state,
                       dspic33_device_advance(cpu, 3u) &&
                           read_counter(cpu, (uint16_t)(base + 6u)) == expected &&
                           dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) ==
                               (uint16_t)action,
                       "QEI quadrature truth table transition");
            }
        }
    }
}

static void divider_polarity_output_cases(TestState* state, Dspic33* cpu) {
    static const uint16_t counter_divisors[8] = {1u, 2u, 4u, 8u, 16u, 32u, 64u, 128u};
    static const uint16_t filter_divisors[8] = {1u, 2u, 4u, 8u, 16u, 32u, 64u, 256u};
    static const int32_t positions[3] = {1, 3, 6};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint8_t selection;
        for (selection = 0u; selection < 8u; selection++) {
            uint16_t divisor = counter_divisors[selection];
            reset_qei(cpu);
            set_open_comparison_window(cpu, base);
            dspic33_write_word(cpu, base,
                               (uint16_t)(QEI_ENABLE |
                                          ((uint16_t)selection << QEI_DIVIDER_SHIFT) |
                                          QEI_MODE_TIMER));
            expect(state,
                   dspic33_device_advance(cpu, (uint16_t)(divisor - 1u)) &&
                       read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
                   "QEI counter divider waits for its complete period");
            expect(state,
                   dspic33_device_advance(cpu, 1u) &&
                       read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
                   "QEI counter divider clocks at the selected period");

            divisor = filter_divisors[selection];
            reset_qei(cpu);
            set_open_comparison_window(cpu, base);
            dspic33_write_word(
                cpu, (uint16_t)(base + 2u),
                (uint16_t)(QEI_FILTER_ENABLE | ((uint16_t)selection << 11u)));
            dspic33_write_word(cpu, base, QEI_ENABLE);
            input(cpu, channel, DSPIC33_QEI_PHASE_A, true);
            expect(state,
                   dspic33_device_advance(cpu, (uint16_t)(3u * divisor - 1u)) &&
                       read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
                   "QEI filter divider waits for three complete samples");
            expect(state,
                   dspic33_device_advance(cpu, 1u) &&
                       read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
                   "QEI filter divider accepts the third stable sample");
        }

        for (selection = 0u; selection < 4u; selection++) {
            uint16_t polarity = (uint16_t)(1u << (4u + selection));
            reset_qei(cpu);
            dspic33_write_word(cpu, (uint16_t)(base + 2u), polarity);
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 0x000fu) ==
                       (uint16_t)(1u << selection),
                   "QEI input polarity inverts a low physical input");
            expect(state,
                   input(cpu, channel, (Dspic33QeiInput)selection, true) &&
                       (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 0x000fu) == 0u,
                   "QEI input polarity inverts a high physical input");
        }

        for (selection = 0u; selection < 4u; selection++) {
            uint8_t position_index;
            for (position_index = 0u; position_index < 3u; position_index++) {
                bool high;
                bool expected = (selection == 1u && positions[position_index] >= 5) ||
                                (selection == 2u && positions[position_index] <= 2) ||
                                (selection == 3u && (positions[position_index] >= 5 ||
                                                     positions[position_index] <= 2));
                reset_qei(cpu);
                write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu),
                              5u);
                write_counter(cpu, (uint16_t)(base + 0x20u), (uint16_t)(base + 0x22u),
                              2u);
                write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au),
                              (uint32_t)positions[position_index]);
                dspic33_write_word(cpu, (uint16_t)(base + 2u),
                                   (uint16_t)(selection << 9u));
                expect(state,
                       dspic33_qei_compare_output(cpu, channel, &high) &&
                           high == expected,
                       "QEI compare output mode follows both signed boundaries");
            }
        }
    }
}

