tylertms/dspic33e-sim/tests/device/qei_test.c
static void external_mode_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_MODE_UP_DOWN);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "QEI external up direction inputs");
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI external up direction increments");
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, false) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_B, false) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "QEI external down direction inputs");
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI external down direction decrements");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_GATE_ENABLE | QEI_MODE_GATE);
        expect(state, input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "QEI gated external clock while gate low");
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI low gate inhibits external clock");
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, false) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "QEI gated external clock while gate high");
        expect(state,
               read_counter(cpu, (uint16_t)(base + 6u)) == 1u &&
                   read_counter(cpu, (uint16_t)(base + 0x16u)) == 0u &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 0u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 1u,
               "QEI external mode applies independent timer gates");
        expect(state,
               dspic33_device_advance(cpu, 5u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 0u,
               "QEI external gate mode does not also clock from FCY");

        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, false) &&
                   input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   input(cpu, channel, DSPIC33_QEI_HOME, true) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 2u &&
                   read_counter(cpu, (uint16_t)(base + 0x16u)) == 1u &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 1u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 1u,
               "QEI external clock drives each enabled timer gate");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_MODE_GATE);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u &&
                   read_counter(cpu, (uint16_t)(base + 0x16u)) == 0u &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 0u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 1u,
               "QEI external ungated mode clocks position and velocity together");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   input(cpu, channel, DSPIC33_QEI_HOME, true),
               "apply QEI external timer gate inputs");
        dspic33_write_word(cpu, base, QEI_ENABLE | 0x0008u | QEI_MODE_GATE);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == UINT32_MAX &&
                   read_counter(cpu, (uint16_t)(base + 0x16u)) == UINT32_MAX &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 1u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == UINT16_MAX,
               "QEI external timer direction excludes only the interval timer");
    }
}

static void timer_filter_power_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_MODE_TIMER);
        expect(state, dspic33_device_advance(cpu, 8u), "advance QEI internal timer");
        expect(state,
               read_counter(cpu, (uint16_t)(base + 6u)) == 8u &&
                   read_counter(cpu, (uint16_t)(base + 0x16u)) == 0u &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 0u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 8u,
               "QEI internal ungated mode clocks position and velocity together");
        dspic33_write_word(cpu, base,
                           QEI_ENABLE | (2u << QEI_INDEX_MATCH_SHIFT) | QEI_MODE_TIMER);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   input(cpu, channel, DSPIC33_QEI_HOME, true) &&
                   dspic33_device_advance(cpu, 4u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 12u &&
                   read_counter(cpu, (uint16_t)(base + 0x16u)) == 4u &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 4u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 4u,
               "QEI internal mode clocks each counter through its input gate");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   input(cpu, channel, DSPIC33_QEI_HOME, true),
               "apply QEI internal timer gate inputs");
        dspic33_write_word(cpu, base, QEI_ENABLE | 0x0008u | QEI_MODE_TIMER);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == UINT32_MAX &&
                   read_counter(cpu, (uint16_t)(base + 0x16u)) == UINT32_MAX &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 1u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == UINT16_MAX,
               "QEI internal direction excludes only the interval timer");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_GATE_ENABLE | QEI_MODE_TIMER);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI internal position gate inhibits while QEB is low");
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   dspic33_device_advance(cpu, 1u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI internal position gate enables while QEB is high");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base,
                           QEI_ENABLE | (7u << QEI_DIVIDER_SHIFT) | QEI_MODE_TIMER);
        expect(state,
               dspic33_device_advance(cpu, 127u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI prescaler 111 waits 128 clocks");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI prescaler 111 clocks at 1 to 128");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_FILTER_ENABLE | (7u << 11u));
        dspic33_write_word(cpu, base, QEI_ENABLE);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   dspic33_device_advance(cpu, 255u) &&
                   cpu->io.qei.filter_stability[channel][0] == 0u,
               "QEI filter divider 111 waits 256 clocks");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   cpu->io.qei.filter_stability[channel][0] == 1u,
               "QEI filter divider 111 samples at 1 to 256");
        expect(state,
               dspic33_device_advance(cpu, 512u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI filtered input accepts after three divided samples");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_FILTER_ENABLE);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   dspic33_device_advance(cpu, 3u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 1u) != 0u &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 4u)) == 0u,
               "QEI filter and live input operate while counters are disabled");
        dspic33_write_word(cpu, base, QEI_ENABLE);
        expect(state,
               read_counter(cpu, (uint16_t)(base + 6u)) == 0u &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   dspic33_device_advance(cpu, 3u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI counter enable uses the established filtered baseline");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_FILTER_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        expect(state, input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "apply QEI filtered phase change");
        expect(state,
               read_counter(cpu, (uint16_t)(base + 6u)) == 0u &&
                   dspic33_device_advance(cpu, 2u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI filter rejects before three samples");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI filter accepts third stable sample");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_FILTER_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   dspic33_device_advance(cpu, 3u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 0u,
               "QEI aggregate filtered edge preserves interval chronology");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_FILTER_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_GATE_ENABLE | QEI_MODE_TIMER);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   dspic33_device_advance(cpu, 3u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 0u,
               "QEI aggregate filter does not retroactively enable timer gates");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 1u,
               "QEI filtered timer gate applies after acceptance");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        expect(state,
               dspic33_device_advance(cpu, 5u) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 0u &&
                   read_counter(cpu, (uint16_t)(base + 0x12u)) == 0u,
               "QEI first count pulse arms and clears interval timer");
        expect(state,
               dspic33_device_advance(cpu, 7u) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   read_counter(cpu, (uint16_t)(base + 0x12u)) == 7u &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 0u,
               "QEI second count pulse captures elapsed interval");

        expect(state,
               dspic33_read_word(cpu, (uint16_t)(base + 0x12u)) == 7u &&
                   cpu->io.qei.interval_hold_locked[channel],
               "QEI interval hold low read locks the captured pair");
        expect(state,
               dspic33_device_advance(cpu, 6u) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, false) &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x12u)) == 7u,
               "QEI locked interval hold resists the next capture");
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(base + 0x14u)) == 0u &&
                   !cpu->io.qei.interval_hold_locked[channel],
               "QEI interval hold high read releases the captured pair");
        expect(state,
               dspic33_device_advance(cpu, 9u) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_B, false) &&
                   read_counter(cpu, (uint16_t)(base + 0x12u)) == 9u,
               "QEI released interval hold accepts the next capture");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_STOP_IDLE | QEI_MODE_TIMER);
        cpu->power_state = DSPIC33_POWER_IDLE;
        expect(state,
               dspic33_device_advance(cpu, 4u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI stop idle freezes counters");
        cpu->power_state = DSPIC33_POWER_ACTIVE;
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI resumes after idle");
        cpu->power_state = DSPIC33_POWER_SLEEP;
        expect(state,
               dspic33_device_advance(cpu, 3u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI sleep freezes counters");
        cpu->power_state = DSPIC33_POWER_ACTIVE;
    }
}

static void interrupt_compare_index_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t status_address = (uint16_t)(base + 4u);
        bool output;
        reset_qei(cpu);
        configure_interrupt(cpu, channel);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, status_address,
                           QEI_STATUS_INDEX_ENABLE | QEI_STATUS_HOME_ENABLE |
                               QEI_STATUS_POSITION_OVERFLOW_ENABLE |
                               QEI_STATUS_VELOCITY_OVERFLOW_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        expect(state, input(cpu, channel, DSPIC33_QEI_INDEX, true),
               "apply QEI accepted index event");
        expect(state,
               (dspic33_read_word(cpu, status_address) & QEI_STATUS_INDEX) != 0u &&
                   interrupt_set(cpu, channel),
               "QEI index event sets status and module IRQ");
        expect(state,
               dspic33_device_interrupt_pending(cpu) &&
                   dspic33_device_service_interrupt(cpu) &&
                   cpu->last_interrupt == (channel == 0u ? 58u : 75u) &&
                   cpu->pc == QEI_VECTOR,
               "QEI module IRQ reaches its firmware vector");
        dspic33_device_return_interrupt(cpu);
        dspic33_write_word(
            cpu, status_address,
            (uint16_t)(dspic33_read_word(cpu, status_address) & ~QEI_STATUS_INDEX));
        clear_interrupt(cpu, channel);
        expect(state,
               (dspic33_read_word(cpu, status_address) & QEI_STATUS_INDEX) == 0u &&
                   !interrupt_set(cpu, channel),
               "QEI status flag is software clear only");
        dspic33_write_word(
            cpu, status_address,
            (uint16_t)(dspic33_read_word(cpu, status_address) | QEI_STATUS_INDEX));
        expect(state, (dspic33_read_word(cpu, status_address) & QEI_STATUS_INDEX) == 0u,
               "QEI cleared status flag cannot be software set");
        expect(state, input(cpu, channel, DSPIC33_QEI_HOME, true),
               "apply QEI home event");
        expect(state, (dspic33_read_word(cpu, status_address) & QEI_STATUS_HOME) != 0u,
               "QEI home event sets status");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, status_address,
                           QEI_STATUS_POSITION_OVERFLOW_ENABLE |
                               QEI_STATUS_VELOCITY_OVERFLOW_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au),
                      0x7fffffffu);
        dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), 0x7fffu);
        expect(state, input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "apply QEI signed overflow pulse");
        expect(state,
               (dspic33_read_word(cpu, status_address) &
                (QEI_STATUS_POSITION_OVERFLOW | QEI_STATUS_VELOCITY_OVERFLOW)) ==
                   (QEI_STATUS_POSITION_OVERFLOW | QEI_STATUS_VELOCITY_OVERFLOW),
               "QEI position and velocity signed overflow flags set");
        expect(state,
               read_counter(cpu, (uint16_t)(base + 6u)) == 0x80000000u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 0x8000u,
               "QEI signed counters wrap at positive limit");
        expect(state, interrupt_set(cpu, channel),
               "QEI overflow sources aggregate IRQ");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au),
                      0x80000000u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), 0x8000u);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0x7fffffffu &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 0x7fffu,
               "QEI signed counters wrap at negative limit");

        reset_qei(cpu);
        dspic33_write_word(cpu, (uint16_t)(base + 0x1eu), 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x1cu), 5u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x22u), 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x20u), 2u);
        dspic33_write_word(cpu, status_address,
                           QEI_STATUS_LOW_COMPARE_ENABLE |
                               QEI_STATUS_HIGH_COMPARE_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_MODE_TIMER);
        expect(state, dspic33_device_advance(cpu, 5u),
               "advance QEI comparison boundary");
        expect(state,
               (dspic33_read_word(cpu, status_address) & QEI_STATUS_HIGH_COMPARE) != 0u,
               "QEI high compare status includes equal boundary");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_OUTPUT_GREATER_EQUAL);
        expect(state, dspic33_qei_compare_output(cpu, channel, &output) && output,
               "QEI greater-equal output follows comparison");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_OUTPUT_LESS_EQUAL);
        expect(state, dspic33_qei_compare_output(cpu, channel, &output) && !output,
               "QEI less-equal output follows comparison");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_OUTPUT_OUTSIDE);
        expect(state, dspic33_qei_compare_output(cpu, channel, &output) && output,
               "QEI combined comparison output follows either bound");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 9u);
        dspic33_write_word(cpu, base, QEI_ENABLE | (1u << QEI_POSITION_MODE_SHIFT));
        expect(state, input(cpu, channel, DSPIC33_QEI_INDEX, true),
               "apply QEI mode one index");
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI mode one index clears position");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 9u);
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu),
                      0x12345678u);
        dspic33_write_word(cpu, base, QEI_ENABLE | (2u << QEI_POSITION_MODE_SHIFT));
        expect(state,
               input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0x12345678u &&
                   (dspic33_read_word(cpu, base) & (7u << QEI_POSITION_MODE_SHIFT)) ==
                       0u,
               "QEI mode two loads IC on the next Index event");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 9u);
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu),
                      0x12345678u);
        dspic33_write_word(cpu, status_address, QEI_STATUS_INITIALIZED_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE | (3u << QEI_POSITION_MODE_SHIFT));
        expect(state,
               input(cpu, channel, DSPIC33_QEI_HOME, true) &&
                   input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0x12345678u &&
                   (dspic33_read_word(cpu, status_address) & QEI_STATUS_INITIALIZED) !=
                       0u &&
                   (dspic33_read_word(cpu, base) & (7u << QEI_POSITION_MODE_SHIFT)) ==
                       0u,
               "QEI mode three loads IC on the first Index after Home");

        reset_qei(cpu);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 4u);
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu), 5u);
        write_counter(cpu, (uint16_t)(base + 0x20u), (uint16_t)(base + 0x22u),
                      UINT32_MAX);
        dspic33_write_word(cpu, base, QEI_ENABLE | (5u << QEI_POSITION_MODE_SHIFT));
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI mode five resets position at the greater-equal count");

