tylertms/dspic33e-sim/tests/device/qei_test.c
        reset_qei(cpu);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 5u);
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu), 5u);
        write_counter(cpu, (uint16_t)(base + 0x20u), (uint16_t)(base + 0x22u), 2u);
        dspic33_write_word(cpu, base, QEI_ENABLE | (6u << QEI_POSITION_MODE_SHIFT));
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 2u,
               "QEI mode six wraps the upper limit to the lower limit");

        {
            uint8_t match;
            for (match = 0u; match < 4u; match++) {
                uint8_t initial = (uint8_t)(match ^ 3u);
                reset_qei(cpu);
                set_open_comparison_window(cpu, base);
                expect(
                    state,
                    input(cpu, channel, DSPIC33_QEI_PHASE_A, (initial & 1u) != 0u) &&
                        input(cpu, channel, DSPIC33_QEI_PHASE_B, (initial & 2u) != 0u),
                    "QEI establishes the nonmatching IMV phase baseline");
                dspic33_write_word(cpu, status_address, QEI_STATUS_INDEX_ENABLE);
                dspic33_write_word(
                    cpu, base, QEI_ENABLE | ((uint16_t)match << QEI_INDEX_MATCH_SHIFT));
                expect(
                    state,
                    input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                        (dspic33_read_word(cpu, status_address) & QEI_STATUS_INDEX) ==
                            0u &&
                        input(cpu, channel, DSPIC33_QEI_PHASE_A, (match & 1u) != 0u) &&
                        input(cpu, channel, DSPIC33_QEI_PHASE_B, (match & 2u) != 0u) &&
                        (dspic33_read_word(cpu, status_address) & QEI_STATUS_INDEX) !=
                            0u &&
                        interrupt_set(cpu, channel),
                    "QEI IMV phase table accepts only the programmed state");
            }
        }

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 9u);
        dspic33_write_word(cpu, status_address, QEI_STATUS_INDEX_ENABLE);
        dspic33_write_word(cpu, base,
                           QEI_ENABLE | QEI_MODE_UP_DOWN |
                               (1u << QEI_POSITION_MODE_SHIFT) |
                               (3u << QEI_INDEX_MATCH_SHIFT) | QEI_DIRECTION_INVERT);
        {
            bool index_high = input(cpu, channel, DSPIC33_QEI_INDEX, true);
            bool phase_high = input(cpu, channel, DSPIC33_QEI_PHASE_A, true);
            uint16_t status = dspic33_read_word(cpu, status_address);
            expect(state, index_high && phase_high && (status & QEI_STATUS_INDEX) == 0u,
                   "QEI asserted Index waits for the programmed phase match");
        }
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u &&
                   (dspic33_read_word(cpu, status_address) & QEI_STATUS_INDEX) != 0u &&
                   interrupt_set(cpu, channel),
               "QEI phase transition completes an asserted Index match");
        dspic33_write_word(
            cpu, status_address,
            (uint16_t)(dspic33_read_word(cpu, status_address) & ~QEI_STATUS_INDEX));
        clear_interrupt(cpu, channel);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, false) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   (dspic33_read_word(cpu, status_address) & QEI_STATUS_INDEX) == 0u &&
                   !interrupt_set(cpu, channel),
               "QEI asserted Index cannot retrigger after phase re-entry");
        expect(state,
               input(cpu, channel, DSPIC33_QEI_INDEX, false) &&
                   input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   (dspic33_read_word(cpu, status_address) & QEI_STATUS_INDEX) != 0u &&
                   interrupt_set(cpu, channel),
               "QEI deasserted Index rearms the next match event");
        dspic33_write_word(cpu, base, 0u);
        expect(state, input(cpu, channel, DSPIC33_QEI_INDEX, false),
               "QEI disabled Index deassertion updates the input baseline");
        dspic33_write_word(
            cpu, status_address,
            (uint16_t)(dspic33_read_word(cpu, status_address) & ~QEI_STATUS_INDEX));
        clear_interrupt(cpu, channel);
        dspic33_write_word(cpu, base,
                           QEI_ENABLE | (1u << QEI_POSITION_MODE_SHIFT) |
                               (3u << QEI_INDEX_MATCH_SHIFT));
        expect(state,
               input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   (dspic33_read_word(cpu, status_address) & QEI_STATUS_INDEX) != 0u &&
                   interrupt_set(cpu, channel),
               "QEI disabled Index deassertion rearms after enable");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 7u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_CAPTURE_HOME);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   read_counter(cpu, (uint16_t)(base + 0x1cu)) != 7u,
               "QEI index does not trigger position capture");
        expect(state,
               input(cpu, channel, DSPIC33_QEI_HOME, true) &&
                   read_counter(cpu, (uint16_t)(base + 0x1cu)) == 7u,
               "QEI Home captures position into IC alias");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 9u);
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu),
                      0x12345678u);
        dspic33_write_word(cpu, status_address, QEI_STATUS_INITIALIZED_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE | (4u << QEI_POSITION_MODE_SHIFT));
        expect(state,
               input(cpu, channel, DSPIC33_QEI_HOME, true) &&
                   input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 9u &&
                   (dspic33_read_word(cpu, status_address) & QEI_STATUS_INITIALIZED) ==
                       0u,
               "QEI mode four waits after first index following Home");
        expect(state,
               input(cpu, channel, DSPIC33_QEI_INDEX, false) &&
                   input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0x12345678u &&
                   (dspic33_read_word(cpu, status_address) & QEI_STATUS_INITIALIZED) !=
                       0u,
               "QEI mode four initializes on second index following Home");

        reset_qei(cpu);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 1u);
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu), 1u);
        write_counter(cpu, (uint16_t)(base + 0x20u), (uint16_t)(base + 0x22u), 5u);
        dspic33_write_word(
            cpu, base, QEI_ENABLE | (6u << QEI_POSITION_MODE_SHIFT) | QEI_MODE_TIMER);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 2u,
               "QEI timer mode ignores position initialization mode");

        reset_qei(cpu);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 9u);
        dspic33_write_word(
            cpu, base, QEI_ENABLE | (1u << QEI_POSITION_MODE_SHIFT) | QEI_MODE_GATE);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 9u,
               "QEI external gate mode ignores index initialization mode");

        reset_qei(cpu);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 2u);
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu), 2u);
        write_counter(cpu, (uint16_t)(base + 0x20u), (uint16_t)(base + 0x22u), 5u);
        dspic33_write_word(cpu, base,
                           QEI_ENABLE | (6u << QEI_POSITION_MODE_SHIFT) | 0x0008u);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 5u,
               "QEI B1 modulo erratum swaps limits with inverted direction");

        reset_qei(cpu);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   input(cpu, channel, DSPIC33_QEI_HOME, true),
               "apply persistent QEI inputs before warm reset");
        expect(state,
               dspic33_load_program_word(cpu, 0u, 0xfe0000u) &&
                   dspic33_step(cpu) == DSPIC33_RUNNING &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 0x000fu) == 0x0009u,
               "QEI warm reset preserves external input levels");
    }
}

static void compare_refresh_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t status_address = (uint16_t)(base + 4u);
        reset_qei(cpu);
        configure_interrupt(cpu, channel);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 5u);
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu), 5u);
        write_counter(cpu, (uint16_t)(base + 0x20u), (uint16_t)(base + 0x22u), 2u);
        dspic33_write_word(cpu, status_address, QEI_STATUS_HIGH_COMPARE_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        expect(state,
               (dspic33_read_word(cpu, status_address) & QEI_STATUS_HIGH_COMPARE) !=
                       0u &&
                   interrupt_set(cpu, channel),
               "QEI enable refreshes the active high comparison");

        reset_qei(cpu);
        configure_interrupt(cpu, channel);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 0u);
        set_open_comparison_window(cpu, base);
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu),
                      0x00010000u);
        dspic33_write_word(cpu, status_address, QEI_STATUS_HIGH_COMPARE_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        clear_interrupt(cpu, channel);
        dspic33_write_word(cpu, status_address,
                           (uint16_t)(dspic33_read_word(cpu, status_address) &
                                      ~QEI_STATUS_HIGH_COMPARE));
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 1u);
        expect(state,
               (dspic33_read_word(cpu, status_address) & QEI_STATUS_HIGH_COMPARE) !=
                       0u &&
                   interrupt_set(cpu, channel),
               "QEI position high write refreshes the active comparison");

        reset_qei(cpu);
        configure_interrupt(cpu, channel);
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au), 2u);
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu), 5u);
        write_counter(cpu, (uint16_t)(base + 0x20u), (uint16_t)(base + 0x22u), 2u);
        dspic33_write_word(cpu, status_address, QEI_STATUS_LOW_COMPARE_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        expect(state,
               (dspic33_read_word(cpu, status_address) & QEI_STATUS_LOW_COMPARE) !=
                       0u &&
                   interrupt_set(cpu, channel),
               "QEI low comparison raises its enabled interrupt");

        reset_qei(cpu);
        configure_interrupt(cpu, channel);
        set_open_comparison_window(cpu, base);
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu),
                      0x12345678u);
        dspic33_write_word(cpu, status_address, QEI_STATUS_INITIALIZED_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE | (3u << QEI_POSITION_MODE_SHIFT));
        expect(state,
               input(cpu, channel, DSPIC33_QEI_HOME, true) &&
                   input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   (dspic33_read_word(cpu, status_address) & QEI_STATUS_INITIALIZED) !=
                       0u &&
                   interrupt_set(cpu, channel),
               "QEI completed homing initialization raises its enabled interrupt");
    }
}

static void power_lifecycle_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_MODE_TIMER);
        cpu->power_state = DSPIC33_POWER_IDLE;
        expect(state,
               dspic33_device_advance(cpu, 3u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 3u,
               "QEI continues its internal timer in Idle when enabled");
        cpu->power_state = DSPIC33_POWER_ACTIVE;

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        cpu->power_state = DSPIC33_POWER_SLEEP;
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI ignores external count edges in Sleep");
        cpu->power_state = DSPIC33_POWER_ACTIVE;
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI resumes from the physical input level after Sleep");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_FILTER_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        cpu->power_state = DSPIC33_POWER_SLEEP;
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   dspic33_device_advance(cpu, 10u) &&
                   cpu->io.qei.filter_stability[channel][0] == 0u,
               "QEI filter clock stops in Sleep");
        cpu->power_state = DSPIC33_POWER_ACTIVE;
        expect(state,
               dspic33_device_advance(cpu, 3u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI filter restarts after Sleep");

        reset_qei(cpu);
        input(cpu, channel, DSPIC33_QEI_HOME, true);
        dspic33_reset(cpu, 0u);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 0x0008u) != 0u,
               "QEI cold reset preserves the physical input level");
        input(cpu, channel, DSPIC33_QEI_HOME, false);
    }

    {
        bool high;
        expect(
            state,
            !dspic33_qei_input(cpu, DSPIC33_QEI_COUNT, DSPIC33_QEI_PHASE_A, true, 0u) &&
                !dspic33_qei_input(cpu, 0u, (Dspic33QeiInput)4u, true, 0u) &&
                !dspic33_qei_compare_output(cpu, DSPIC33_QEI_COUNT, &high) &&
                !dspic33_qei_compare_output(cpu, 0u, NULL),
            "QEI public APIs reject invalid arguments");
    }
}

static void pps_cases(TestState* state, Dspic33* cpu) {
    for (uint8_t channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        for (uint8_t source = 0u; source < 4u; source++) {
            uint16_t bit = (uint16_t)(1u << source);
            reset_qei(cpu);
            dspic33_gpio_release(cpu, 3u, 0x000fu);
            dspic33_gpio_drive(cpu, 3u, 0u, bit);
            select_pps_input(cpu, channel, source, (uint8_t)(64u + source));
            expect(state,
                   dspic33_gpio_drive(cpu, 3u, bit, bit) &&
                       (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & bit) != 0u,
                   "QEI RPINR input follows its selected physical pin");
            expect(state,
                   dspic33_gpio_drive(cpu, 3u, 0u, bit) &&
                       (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & bit) == 0u,
                   "QEI RPINR input follows the selected pin low");
        }

        reset_qei(cpu);
        dspic33_gpio_release(cpu, 1u, 0x0001u);
        dspic33_gpio_drive(cpu, 1u, 0x0001u, 0x0001u);
        dspic33_write_word(cpu, 0x0e1eu, 0u);
        select_pps_input(cpu, channel, DSPIC33_QEI_PHASE_A, 32u);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 1u) == 0u,
               "QEI input-only RPI rejects a cleared ANS bit");
        dspic33_write_word(cpu, 0x0e1eu, 1u);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 1u) != 0u,
               "QEI input-only RPI accepts a set ANS bit");

        reset_qei(cpu);
        dspic33_gpio_release(cpu, 3u, 0x0001u);
        dspic33_gpio_drive(cpu, 3u, 0x0001u, 0x0001u);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_MODE_UP_DOWN);
        select_pps_input(cpu, channel, DSPIC33_QEI_PHASE_A, 64u);
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == UINT32_MAX,
               "QEI RPINR remap applies its unfiltered input transition");
        dspic33_gpio_drive(cpu, 3u, 0u, 0x0001u);
        dspic33_gpio_drive(cpu, 3u, 0x0001u, 0x0001u);
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == UINT32_MAX - 1u,
               "QEI RPINR stable mapping counts a later physical edge");

        reset_qei(cpu);
        dspic33_gpio_release(cpu, 3u, 0x0001u);
        dspic33_gpio_drive(cpu, 3u, 0u, 0x0001u);
        select_pps_input(cpu, channel, DSPIC33_QEI_PHASE_A, 64u);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_FILTER_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_MODE_UP_DOWN);
        dspic33_gpio_drive(cpu, 3u, 0x0001u, 0x0001u);
        expect(state,
               dspic33_device_advance(cpu, 2u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 1u) == 0u &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI filtered PPS input rejects fewer than three stable samples");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 1u) != 0u &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == UINT32_MAX,
               "QEI filtered PPS input accepts its third stable sample");

        reset_qei(cpu);
        dspic33_gpio_release(cpu, 3u, 0x0003u);
        dspic33_gpio_drive(cpu, 3u, 0u, 0x0003u);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        select_pps_input(cpu, channel, DSPIC33_QEI_PHASE_A, 64u);
        select_pps_input(cpu, channel, DSPIC33_QEI_PHASE_B, 64u);
        expect(state,
               dspic33_gpio_drive(cpu, 3u, 0x0001u, 0x0001u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI many-to-one PPS transition applies both phases simultaneously");

        reset_qei(cpu);
        dspic33_gpio_release(cpu, 3u, 0x0003u);
        dspic33_gpio_drive(cpu, 3u, 0u, 0x0003u);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        select_pps_input(cpu, channel, DSPIC33_QEI_PHASE_A, 64u);
        select_pps_input(cpu, channel, DSPIC33_QEI_PHASE_B, 65u);
        expect(state,
               dspic33_gpio_drive(cpu, 3u, 0x0003u, 0x0003u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI masked GPIO transition applies separate phases simultaneously");

        reset_qei(cpu);
        dspic33_gpio_release(cpu, 3u, (uint16_t)(1u << channel));
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        dspic33_write_word(cpu, 0x0e34u, 0u);
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu), 0u);
        dspic33_write_byte(cpu, (uint16_t)(0x0680u + channel),
                           (uint8_t)(47u + channel));
        {
            bool high = true;
            expect(state, dspic33_gpio_pin(cpu, 3u, channel, &high) && !high,
                   "disabled QEI compare output leaves GPIO ownership unchanged");
        }
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_OUTPUT_GREATER_EQUAL);
        {
            bool high = false;
            expect(state, dspic33_gpio_pin(cpu, 3u, channel, &high) && high,
                   "QEI RPOR compare output overrides GPIO direction");
        }
        dspic33_write_word(cpu, 0x0e36u, (uint16_t)(1u << channel));
        dspic33_gpio_drive(cpu, 3u, 0u, (uint16_t)(1u << channel));
        {
            bool high = true;
            expect(state, dspic33_gpio_pin(cpu, 3u, channel, &high) && !high,
                   "QEI open-drain compare high releases to an external low");
        }
        dspic33_gpio_drive(cpu, 3u, (uint16_t)(1u << channel),
                           (uint16_t)(1u << channel));
        {
            bool high = false;
            expect(state, dspic33_gpio_pin(cpu, 3u, channel, &high) && high,
                   "QEI open-drain compare high releases to an external high");
        }
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu), 1u);
        {
            bool high = true;
            expect(state, dspic33_gpio_pin(cpu, 3u, channel, &high) && !high,
                   "QEI RPOR compare output follows its comparison state");
        }
        dspic33_write_word(cpu, 0x0e36u, 0u);
        dspic33_gpio_release(cpu, 3u, (uint16_t)(1u << channel));
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu), 0u);
        {
            bool before = false;
            bool after = true;
            bool driven = dspic33_gpio_pin(cpu, 3u, channel, &before) && before;
            dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
            expect(state,
                   driven && dspic33_device_advance(cpu, 1u) &&
                       dspic33_gpio_pin(cpu, 3u, channel, &after) && !after,
                   "QEI PMD releases its mapped RPOR output");
        }
        dspic33_write_byte(cpu, (uint16_t)(0x0680u + channel), 0u);
        {
            bool high = true;
            expect(state, dspic33_gpio_pin(cpu, 3u, channel, &high) && !high,
                   "QEI RPOR removal restores GPIO ownership");
        }

        reset_qei(cpu);
        dspic33_gpio_release(cpu, 3u, 0x0001u);
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu), 1u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_OUTPUT_GREATER_EQUAL);
        dspic33_write_byte(cpu, 0x0680u, (uint8_t)(47u + channel));
        dspic33_write_byte(cpu, 0x06aeu, 64u);
        dspic33_write_word(cpu, CAPTURE_BASE, CAPTURE_FP_RISING);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_MODE_TIMER);
        {
            bool pin_high = false;
            expect(state,
                   dspic33_device_advance(cpu, 1u) &&
                       dspic33_gpio_pin(cpu, 3u, 0u, &pin_high) && pin_high &&
                       cpu->io.input_capture.fifo[0].count == 0u,
                   "QEI RPOR transition fans out to another PPS input consumer");
            expect(state,
                   dspic33_device_advance(cpu, 1u) &&
                       cpu->io.input_capture.fifo[0].count == 1u,
                   "QEI RPOR fanout observes the input capture pipeline delay");
        }

